backend/app/Controllers/Register.php

INSERT INTO `temporary_users` (`email`, `phone`) VALUES ('hammm@mail.com', '08989898989')
---
    public function index()
    {
        helper(['form']);
        $rules = [
            'email' => 'required|valid_email|is_unique[users.email]',
            'phone' => 'required|min_length[8]|is_unique[users.phone]|numeric',
        ];
        if (!$this->validate($rules)) return $this->fail($this->validator->getErrors());
        $data = [
            'email'     => $this->request->getVar('email'),
            'phone'     => $this->request->getVar('phone'),
        ];
        $model = new TemporaryUserModel();
        $registered = $model->save($data);